# Ex - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'
df = pd.read_csv(url)
drink = df

### Step 4. Which continent drinks more beer on average?

In [4]:
drink['total_litres_of_pure_alcohol'].groupby(drink['continent']).mean()
# AF

continent
AF    3.007547
AS    2.170455
EU    8.617778
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [5]:
drink['wine_servings'].groupby(drink['continent']).sum()

continent
AF     862
AS     399
EU    6400
OC     570
SA     749
Name: wine_servings, dtype: int64

### Step 6. Print the mean alcohol consumption per continent for every column

In [6]:
drink[['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent']].groupby('continent').mean().astype(int)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61,16,16,3
AS,37,60,9,2
EU,193,132,142,8
OC,89,58,35,3
SA,175,114,62,6

### Step 7. Print the median alcohol consumption per continent for every column

In [7]:
drink[['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent']].groupby('continent').median().astype(int)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32,3,2,2
AS,17,16,1,1
EU,219,122,128,10
OC,52,37,8,1
SA,162,108,12,6

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [15]:
spirit_consumption = pd.DataFrame({
    'Statistic': ['Mean', 'Min', 'Max'],
    'Values': [
    drink['spirit_servings'].mean().astype(int),
    drink['spirit_servings'].min().astype(int),
    drink['spirit_servings'].max().astype(int)
    ]
})

print(spirit_consumption)

  Statistic  Values
0      Mean      80
1       Min       0
2       Max     438